// cafes collection
const cafes = [
  {
    user_Id: "DK Computer",
    user_Name: "DK Computer",
    city: "Kondagaon",
    avtar_Url: "img.jpg",
    phone_No: "919617709663",
  },
  // {
  //   user_Name: "PS Computer",
  //   city: "Golawand",
  //   avtar_Url: "img.jpg",
  //   phone_No: "917974755379",
  // },
];

// result collection

export const resultArr = [
  {
    url_Id: "smkv_results",
    url: "https://smkvbj.uonex.in/GetResultsexam",
  },
];

// profiles  collection

// post sample ****
// const post_sample = {
//   post_Id: "",
//   post_Src:
//     "https://drive.google.com/file/d/129kQQ-Va9MjAzIE7Pd_UhQKbj4e01Hnr/preview",
//   title: " ",
//   description: ` `,
//   date: ["", ""],
//   links: [
//     {
//       text: "Official site",
//       site: "",
//     },
//   ],
//   category: "updates",
//   time_Stamp: "12-08-2025",
// };

const profiles = [
  {
    user_Id: "smkv_bastar",
    user_Name: "SMKV University Bastar",
    city: "Jagdalpur",
    avtar_Url: "img.jpg",
    site_Url: "bastar univerety",
    category: "university",
    posts: [
      {
        post_Id: "133sm1ADozxrr_hq-pfZj4qg73Fk8g6xg",
        post_Src:
          "https://drive.google.com/file/d/133sm1ADozxrr_hq-pfZj4qg73Fk8g6xg/preview",
        title: "smkv enrollment form 2025-26 ",
        description: ` ऑनलाइन आवेदन तिथि में वृद्धि $
 'BA, BSC, BCOM प्रथम सेमेस्टर के विद्यार्थी ध्यान देवें' : ' नामांकन के लिए उन्हें प्रवेश के समय जो कार्ड मिला हुआ है उसे लेकर पहले कॉलेज प्रस्थान करना होगा, कॉलेज में आपको VAC/GE सब्जेक्ट लिखित में प्रदान किया जाएगा। उसके बाद ही अपना नामांकन कराएं। अगर आप नामांकन फॉर्म में अपने से ही VAC/GE विषय का चयन करते हैं,  तो आपको बाद में दिक्कतों का सामना करना पड़ सकता है। $ MA,MSC,MCOM प्रथम सेमेस्टर के विद्यार्थियों को यह करने की आवश्यकता नहीं है, वे बिना रुकावट के अपना नामांकन फॉर्म भरवा सकते हैं🛑'`,
        date: ["start date : 01-08-2025", "last date: 20-08-2025"],
        links: [
          {
            text: "Official site",
            site: "https://smkvbastar.ac.in/",
          },
          {
            text: "Regular enrollment",
            site: "https://smkvbastar.in/",
          },
          {
            text: "  Enrollment, Watch video",
            site: "https://youtu.be/55GW84vn6TA?si=aunr74aZEh2RCC78",
          },
        ],
        category: "updates",
        time_Stamp: "12-08-2025",
      },
    ],
  },
  {
    user_Id: "gundadhurclg_kondagaon",
    user_Name: "Govt Gundadhur PG College, Kondagaon",
    city: "Kondagaon",
    avtar_Url: "img.jpg",
    site_Url: "ggpgcollegekondagaon",
    category: "education",
    posts: [],
  },
  {
    user_Id: "girlsclg_kondagaon",
    user_Name: "Govt girls College, Kondagaon",
    city: "Kondagaon",
    avtar_Url: "img.jpg",
    site_Url: "gmrgcollegekondagaon",
    category: "education",
    posts: [],
  },
  {
    user_Id: "clg_mardapal",
    user_Name: "Govt navin College, Mardapal",
    city: "Mardapal",
    avtar_Url: "img.jpg",
    site_Url: " ",
    posts: [],
  },
];

// update collection

// post sample ****
// const post_sample_02 = {
//   post_Id: "",
//   post_Src:
//     "https://drive.google.com/file/d/129kQQ-Va9MjAzIE7Pd_UhQKbj4e01Hnr/preview",
//   title: " ",
//   description: ` `,
//   date: ["", ""],
//   links: [
//     {
//       text: "Official site",
//       site: "",
//     },
//   ],
//   category: "updates",
// };

const updates = [
  {
    post_Id: "11plHr2m3PN52NtIUzYaaLFuxsoJBYkfp",
    post_Src:
      "https://drive.google.com/file/d/11plHr2m3PN52NtIUzYaaLFuxsoJBYkfp/preview",
    download_Link:
      "https://drive.google.com/file/d/1cUSqQVfPYYX6tUUlXbRScXVn-7EggzgB/view?usp=sharing",
    title: "CG police online form 2025 (PHQC25) ",
    description: `छत्तीसगढ़ पुलिस भर्ती 2024 के  फिजिकल टेस्ट का रिजल्ट जारी हो चुका है । जिन उम्मीदवारों ने फिजिकल टेस्ट दिया था, उनमें से चयनित अभ्यर्थियों की सूची आधिकारिक वेबसाइट पर अपलोड की गई है। ये उम्मीदवार अब लिखित परीक्षा के लिए पात्र माने जाएंगे। $ छत्तीसगढ़ पुलिस फिजिकल रिजल्ट 2025 के बाद अब लिखित परीक्षा के लिए छत्तीसगढ़ पुलिस ऑनलाइन फॉर्म 2025 भरने की प्रक्रिया शुरू हो चुकी है `,
    overView: [
      {
        name: "भर्ती का नाम - छत्तीसगढ़ पुलिस कांस्टेबल भर्ती 2023 ",
        department: " विभाग - छत्तीसगढ़ पुलिस विभाग ",
        post_name: "पद का नाम - कांस्टेबल जीडी , वाहन चालक, ट्रेड्समैन ",
        vacancy: " कुल रिक्तियां - 5967 पद",
        notification: "अधिसूचना जारी होने की तिथि - 20 अक्टूबर 2023 ",
        application_Type: "आवदेन प्रक्रिया - ऑनलाइन",
      },
    ],

    date: [
      "ऑनलाइन स्टार्ट डेट -  05-08-2025",
      "ऑनलाइन लास्ट डेट - 27-08- 2025",
      "एग्जाम डेट - 14-09-2025",
      "एग्जाम टाइम - पूर्वान्ह 02 घंटे",
      "प्रवेश पत्र जारी करने की तिथि -  08-09-2025",
      "परीक्षा केंद्र - 05 संभागीय मुख्यालयों में",
    ],
    links: [
      {
        text: "Official site",
        site: "https://vyapamcg.cgstate.gov.in/",
      },
      {
        text: "Apply",
        site: "https://vyapamprofile.cgstate.gov.in/online/",
      },
      {
        text: "Syllabus",
        site: "https://vyapamcg.cgstate.gov.in/uploads/pdfs/50a0e834-7dbe-45cf-996c-11a477eb3386.pdf",
      },
    ],

    category: "updates",
    time_Stamp: "12-08-2025",
  },
  {
    post_Id: "130ZzKjaKVke2LGvmAbWSm5jj9SDLdIw9",
    post_Src:
      "https://drive.google.com/file/d/130ZzKjaKVke2LGvmAbWSm5jj9SDLdIw9/preview",
    title: " CG post metric scholarship 2025-26 ",
    description: `छत्तीसगढ़ पोस्ट मेट्रिक स्कॉलरशिप का ऑनलाइन आवेदन शुरू हो चुका है।विद्यार्थियों को उनके आधार सीडेड बैंक खाते में भुगतान 07 कार्य दिवस में प्राप्त होगा। पोस्ट मेट्रिक स्कॉलरशिप फॉर्म भरने की अंतिम तिथि 30- 11- 2025 तक है। निर्धारित तिथि के पश्चात शिक्षा सत्र 2025-26 की पोस्ट मेट्रिक स्कॉलरशिप ऑनलाइन आवेदन के लिए पोर्टल बंद कर दिया जाएगा। $ 
छात्रवृति के लिए निम्नानुसार पात्रता निर्धारित है:- $ अनुसूचित जाति अनुसूचित जनजाति विद्यार्थियों के पलक की आय सीमा ₹ 2.50 लाख प्रतिवर्ष, अन्य पिछड़ा वर्ग के लिए आया सीमा ₹ 1.00 लाख प्रतिवर्ष, सक्षम अधिकारी द्वारा जारी स्थाई जाति प्रमाण पत्र, छत्तीसगढ़  मूल निवासी प्रमाण पत्र, स्टूडेंट का पिछले वर्ष का परीक्षा परिणाम। $ 
PFMS के माध्यम से आधार सीडेड बैंक खाते में पोस्ट मेट्रिक स्कॉलरशिप का payment किया जा रहा है । इसलिए सभी स्टूडेंट्स अपने active and aadhaar seeded bank account की details ही online आदेवदन करते समय करें। $ 
Year 2025- 26 में अनुसूचित जाति, अनुसूचित जनजाति एवं अन्य पिछड़ा वर्ग  के स्टूडेंट्स को NSP portal से OTR ( one time registration) प्राप्त करना आवश्यक है। $ आप आवेदन हेतु संपर्क कर सकते हैं, आवश्यक दस्तावेज निम्नलिखित हैं🔰 $

1. 10वीं, 12वीं अंकसूची, पूर्व कक्षा का रिजल्ट $
2. OTR Number  $
3. आय,जाति,निवास  $
4. बैंक पासबुक  $
5. आधार कार्ड  $
6. फोटो, हस्ताक्षर  $
7. मोबाइल नंबर, जीमेल $
8. राशन कार्ड  $
9. कॉलेज रसीद  $`,
    date: [
      "ऑनलाइन स्टार्ट डेट - ऑनलाइन जारी है",
      "ऑनलाइन लास्ट डेट - 30-11-2025",
      "पेमेंट - एप्लीकेशन लॉक करने के 07 दिनों में",
    ],
    links: [
      {
        text: "Official site",
        site: "https://postmatric-scholarship.cg.nic.in/",
      },
      {
        text: "नया रजिस्ट्रेशन",
        site: "https://postmatric-scholarship.cg.nic.in/StudentRegistration.aspx",
      },
      {
        text: "नवीनीकरण",
        site: "https://postmatric-scholarship.cg.nic.in/LoginPage.aspx",
      },
      {
        text: "Renew form fill up video",
        site: "https://youtu.be/9vIcWOGuteo?si=jLT6H-ufTTx9VrDr",
      },
      {
        text: "New registration form fill up video",
        site: "https://youtu.be/PnSbxYV6_2U?si=UmyPmOcNUwIQMluz",
      },
    ],
    category: "scholarship",
    time_Stamp: "14-08-2025",
  },
  {
    post_Id: "136YsL3BLW8cGbpbX72T0uzyZlI_PGka8",
    post_Src:
      "https://drive.google.com/file/d/136YsL3BLW8cGbpbX72T0uzyZlI_PGka8/preview",
    title: " How to Get OTR Number, NSP OTR registration ",
    description: ` छत्तीसगढ़ पोस्ट मेट्रिक स्कॉलरशिप के लिए (st/sc/obc) स्टूडेंट्स को  OTR आनिवार्य कर दिया गया है। $ एनएसपी (नेशनल स्कॉलरशिप पोर्टल) पर छात्रवृत्ति के लिए आवेदन करने के लिए OTR (वन-टाइम रजिस्ट्रेशन) आवश्यक है। यह एक विशिष्ट 14-अंकीय नंबर है जो आधार/आधार नामांकन आईडी के आधार पर जारी किया जाता है और छात्र के पूरे शैक्षणिक जीवन के लिए मान्य होता है। $
एनएसपी ओटीआर क्यों जरूरी है? $
दोहराव कम करना: $
ओटीआर एक ही छात्र को एक ही योजना के लिए बार-बार आवेदन करने से रोकता है, जिससे आवेदन प्रक्रिया में दोहराव कम होता है। $
सुरक्षा बढ़ाना: $
ओटीआर एक विशिष्ट पहचान प्रदान करता है, जिससे धोखाधड़ी और गलत पहचान की संभावना कम हो जाती है। $
छात्रों का बेहतर ट्रैक रखना: $
ओटीआर छात्रों को उनके आवेदन की स्थिति और छात्रवृत्ति विवरण को ट्रैक करने में मदद करता है। $
पारदर्शिता: $
ओटीआर प्रक्रिया छात्रों के लिए अधिक पारदर्शी और निष्पक्ष है। 
संक्षेप में, एनएसपी ओटीआर छात्रों के लिए छात्रवृत्ति आवेदन प्रक्रिया को सरल, सुरक्षित और कुशल बनाने के लिए आवश्यक है `,
    date: [],
    links: [
      {
        text: "Official site",
        site: "https://scholarships.gov.in/Students",
      },
      {
        text: "Apply for OTR ",
        site: "https://scholarships.gov.in/otrapplication/#/login-page",
      },
      {
        text: "NSP OTR APP",
        site: "https://play.google.com/store/apps/details?id=in.gov.scholarships.nspotr",
      },
      {
        text: "Face RD app ",
        site: "https://play.google.com/store/apps/details?id=in.gov.uidai.facerd",
      },
      {
        text: "Watch video on youtube ",
        site: "https://youtu.be/AIRDXMHAYO8?si=0bLtV20YVVjkYVZS",
      },
    ],
    category: "updates",
  },
  {
    post_Id: "13b6CMpbFWlOTOiDR2cxcZVjZ3i9zPRG6",
    post_Src:
      "https://drive.google.com/file/d/13b6CMpbFWlOTOiDR2cxcZVjZ3i9zPRG6/preview",
    title: " CG Staff nursing vacancy 2025 ",
    description: `CG vyapam ने स्वास्थ्य सेवाएं विभाग के अंतर्गत स्टाफ नर्स के 225 पदों के लिए HSSN 25 भर्ती परीक्षा 2025 का आधिकारिक नोटिफिकेशन जारी कर दिया है। यह भर्ती छत्तीसगढ़ के विभिन्न जिलों में कार्यरत हॉस्पिटल्स और स्वास्थ्य संस्थानों में स्टाफ नर्स पदों पर नियुक्ति के लिए आयोजित की जाएगी। 
$
किसी भी अभ्यर्थी को परीक्षा केंद्र के संबंध में कठिनाई होती है तो हेल्पलाइन नंबर 0771-2972780 एवं मोबाइल नंबर 8269801982 पर समय प्रातः 10:00 से सायं 5:30 बजे तक सम्पर्क कर सकते हैं। $
प्रश्न पत्र के मुख्य पृष्ठ पर तीन समान बार  कोड स्टिकर संलग्न हैं। परीक्षार्थी एक बार code स्टिकर ko OMR seat पर, दूसरे बार कोड स्टिकर को प्रश्न पत्र के मुख्य पृष्ठ पर व तीसरे बार code को  स्टिकर को उपस्थित पत्रक पर सावधानीपूर्वक इंगित स्थान पर अवश्य छिपाएं। $
ऋणात्मक मूल्यांकन का प्रावधान है तदानुसार नियत अंक का 1/4 अंक कटा जाएगा। परीक्षार्थी द्वारा जिन प्रश्नों के उत्तर अंकित नहीं किए जाएंगे उनके लिए शून्य अंक प्रदान किया जाएगा। $
व्यापम द्वारा जारी परीक्षा कोड तथा समन्वयक केंद्रों के नाम - $ 
सरगुजा (अंबिकापुर) code - (11 ) राजीव गांधी शासकीय पी जी महाविद्यालय , अंबिकापुर मो. (07774-230921) $
बिलासपुर code - (13) शासकीय ई. राघवेंद्र राव, पीजी विज्ञान महा. , बिलासपुर मो. (07752-246430) $
दुर्ग code ( 16) विश्वनाथ तामस्कर शासकीय कला एवं विज्ञान महा. , दुर्ग मो.(0788-2211688) $
जगदलपुर code(17) शासकीय पीजी महा., जगदलपुर मो.(07782-229340) $
रायपुर code (25) शासकीय नागार्जुन पीजी विज्ञान महा. , रायपुर मो.(0771-2263131) $ `,
    overView: [
      "विभाग - स्वास्थ्य सेवाएं, छत्तीसगढ़",
      "भर्ती - CG vyapam, रायपुर",
      "परीक्षा - HSSN 25 ",
      "पद का नाम - स्टाफ नर्स ",
      "आवेदन - ऑनलाइन ",
      "वेतन - ₹28,700 - 91,300 ( लेवल - 07)",
    ],
    date: [
      "Online स्टार्ट - 13 - 08 - 2025 ",
      "Online लास्ट डेट - 03-09-2025",
      "त्रुटि सुधार तिथि - 04 से 06 -09-2025",
      "प्रवेश पत्र जारी - 15-09-2025",
      "परीक्षा तिथि - 21-09-2025 ( 11:00 AM - 1:15 pm )",
    ],
    links: [
      {
        text: "Official site",
        site: "https://vyapamcg.cgstate.gov.in/",
      },
      {
        text: "Apply online ",
        site: "https://vyapamprofile.cgstate.gov.in/online/",
      },
      {
        text: "Syllabus ",
        site: "https://vyapamcg.cgstate.gov.in/uploads/pdfs/985e0d9b-1c58-4c35-9f9f-6dfc9c93bb70.pdf",
      },
    ],
    category: "updates",
  },
];

export { cafes, profiles, updates };
