// cafes collection
const cafes = [
  {
    user_Id: "DK Computer",
    user_Name: "DK Computer",
    city: "Kondagaon",
    avtar_Url: "img.jpg",
    phone_No: "919617709663",
  },
  // {
  //   user_Name: "PS Computer",
  //   city: "Golawand",
  //   avtar_Url: "img.jpg",
  //   phone_No: "917974755379",
  // },
];

// profiles  collection

// post sample ****
// {
//       post_Id: "129kQQ-Va9MjAzIE7Pd_UhQKbj4e01Hnr",
//       post_Src:
//         "https://drive.google.com/file/d/129kQQ-Va9MjAzIE7Pd_UhQKbj4e01Hnr/preview",
//       download_Link:
//         "https://drive.google.com/file/d/1cUSqQVfPYYX6tUUlXbRScXVn-7EggzgB/view?usp=sharing",
//       title: "smkv enrollment form 2025-26 ",
//       description: `  'BA, BSC, BCOM प्रथम सेमेस्टर के विद्यार्थी ध्यान देवें' : ' नामांकन के लिए उन्हें प्रवेश के समय जो कार्ड मिला हुआ है उसे लेकर पहले कॉलेज प्रस्थान करना होगा, कॉलेज में आपको VAC/GE सब्जेक्ट लिखित में प्रदान किया जाएगा। उसके बाद ही अपना नामांकन कराएं। अगर आप नामांकन फॉर्म में अपने से ही VAC/GE विषय का चयन करते हैं, तो आपको बाद में दिक्कतों का सामना करना पड़ सकता है। MA,MSC,MCOM प्रथम सेमेस्टर के विद्यार्थियों को यह करने की आवश्यकता नहीं है, वे बिना रुकावट के अपना नामांकन फॉर्म भरवा सकते हैं🛑'`,
//       date: ["start date : 01-08-2025", "last date: today"],
//       links: [
//         {
//           text: "Official site",
//           official_Site: "https://smkvbastar.ac.in/",
//         },
//       ],
//       category: "updates",
//       time_Stamp: "12-08-2025",
//     },

const profiles = [
  {
    user_Id: "smkv_bastar",
    user_Name: "SMKV University Bastar",
    city: "Jagdalpur",
    avtar_Url: "img.jpg",
    site_Url: "bastar univerety",
    category: "university",
    posts: [
      {
        post_Id: "129kQQ-Va9MjAzIE7Pd_UhQKbj4e01Hnr",
        post_Src:
          "https://drive.google.com/file/d/129kQQ-Va9MjAzIE7Pd_UhQKbj4e01Hnr/preview",
        download_Link:
          "https://drive.google.com/file/d/1cUSqQVfPYYX6tUUlXbRScXVn-7EggzgB/view?usp=sharing",
        title: "smkv enrollment form 2025-26 ",
        description: `  'BA, BSC, BCOM प्रथम सेमेस्टर के विद्यार्थी ध्यान देवें' : ' नामांकन के लिए उन्हें प्रवेश के समय जो कार्ड मिला हुआ है उसे लेकर पहले कॉलेज प्रस्थान करना होगा, कॉलेज में आपको VAC/GE सब्जेक्ट लिखित में प्रदान किया जाएगा। उसके बाद ही अपना नामांकन कराएं। अगर आप नामांकन फॉर्म में अपने से ही VAC/GE विषय का चयन करते हैं, तो आपको बाद में दिक्कतों का सामना करना पड़ सकता है। MA,MSC,MCOM प्रथम सेमेस्टर के विद्यार्थियों को यह करने की आवश्यकता नहीं है, वे बिना रुकावट के अपना नामांकन फॉर्म भरवा सकते हैं🛑'`,
        date: ["start date : 01-08-2025", "last date: today"],
        links: [
          {
            text: "Official site",
            official_Site: "https://smkvbastar.ac.in/",
          },
        ],
        category: "updates",
        time_Stamp: "12-08-2025",
      },
    ],
  },
  {
    user_Id: "gundadhurclg_kondagaon",
    user_Name: "Govt Gundadhur PG College, Kondagaon",
    city: "Kondagaon",
    avtar_Url: "img.jpg",
    site_Url: "ggpgcollegekondagaon",
    category: "education",
    posts: [],
  },
  {
    user_Id: "girlsclg_kondagaon",
    user_Name: "Govt girls College, Kondagaon",
    city: "Kondagaon",
    avtar_Url: "img.jpg",
    site_Url: "gmrgcollegekondagaon",
    category: "education",
    posts: [],
  },
  {
    user_Id: "clg_mardapal",
    user_Name: "Govt navin College, Mardapal",
    city: "Mardapal",
    avtar_Url: "img.jpg",
    site_Url: " ",
    posts: [],
  },
];

// update collection

const updates = [
  {
    post_Id: "11plHr2m3PN52NtIUzYaaLFuxsoJBYkfp",
    post_Src:
      "https://drive.google.com/file/d/11plHr2m3PN52NtIUzYaaLFuxsoJBYkfp/preview",
    download_Link:
      "https://drive.google.com/file/d/1cUSqQVfPYYX6tUUlXbRScXVn-7EggzgB/view?usp=sharing",
    title: "cg pulice online form 2025 (PHQC25) ",
    description: `छत्तीसगढ़ पुलिस भर्ती 2024 के  फिजिकल टेस्ट का रिजल्ट जारी हो चुका है । जिन उम्मीदवारों ने फिजिकल टेस्ट दिया था, उनमें से चयनित अभ्यर्थियों की सूची आधिकारिक वेबसाइट पर अपलोड की गई है। ये उम्मीदवार अब लिखित परीक्षा के लिए पात्र माने जाएंगे। छत्तीसगढ़ पुलिस फिजिकल रिजल्ट 2025 के बाद अब लिखित परीक्षा के लिए छत्तीसगढ़ पुलिस ऑनलाइन फॉर्म 2025 भरने की प्रक्रिया शुरू हो चुकी है `,
    overView: [
      {
        name: "भर्ती का नाम - छत्तीसगढ़ पुलिस कांस्टेबल भर्ती 2023 ",
        department: " विभाग - छत्तीसगढ़ पुलिस विभाग ",
        post_name: "पद का नाम - कांस्टेबल जीडी , वाहन चालक, ट्रेड्समैन ",
        vacancy: " कुल रिक्तियां - 5967 पद",
        notification: "अधिसूचना जारी होने की तिथि - 20 अक्टूबर 2023 ",
        application_Type: "आवदेन प्रक्रिया - ऑनलाइन",
      },
    ],

    date: [
      "ऑनलाइन स्टार्ट डेट -  05-08-2025",
      "ऑनलाइन लास्ट डेट - 27-08- 2025",
      "एग्जाम डेट - 14-09-2025",
      "एग्जाम टाइम - पूर्वान्ह 02 घंटे",
      "प्रवेश पत्र जारी करने की तिथि -  08-09-2025",
      "परीक्षा केंद्र - 05 संभागीय मुख्यालयों में",
    ],
    links: [
      {
        text: "Official site",
        site: "https://vyapamcg.cgstate.gov.in/",
      },
      {
        text: "Apply",
        site: "https://vyapamprofile.cgstate.gov.in/online/",
      },
      {
        text: "Syllabus",
        site: "https://vyapamcg.cgstate.gov.in/uploads/pdfs/50a0e834-7dbe-45cf-996c-11a477eb3386.pdf",
      },
    ],

    category: "updates",
    time_Stamp: "12-08-2025",
  },
];

export { cafes, profiles, updates };
